src/InformationRegisters/СборИнформацииПоАРМ/СборИнформацииПоАРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СборИнформацииПоАРМ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СборИнформацииПоАРМ/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура УдалитьЗаписиПоНаСервере(ВыбДата)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборИнформацииПоАРМ.Период,
	|	СборИнформацииПоАРМ.ВидОперации,
	|	СборИнформацииПоАРМ.Линейка,
	|	СборИнформацииПоАРМ.РабочееМесто,
	|	СборИнформацииПоАРМ.Изделие
	|ИЗ
	|	РегистрСведений.СборИнформацииПоАРМ КАК СборИнформацииПоАРМ
	|ГДЕ
	|	СборИнформацииПоАРМ.Период <= &Период";
Запрос.УстановитьПараметр("Период", КонецДня(ВыбДата));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Рег = РегистрыСведений.СборИнформацииПоАРМ.СоздатьНаборЗаписей();
	Рег.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
	Рег.Отбор.ВидОперации.Установить(ВыборкаДетальныеЗаписи.ВидОперации);
	Рег.Отбор.Линейка.Установить(ВыборкаДетальныеЗаписи.Линейка);
	Рег.Отбор.РабочееМесто.Установить(ВыборкаДетальныеЗаписи.РабочееМесто);
	Рег.Отбор.Изделие.Установить(ВыборкаДетальныеЗаписи.Изделие);
	Рег.Записать();
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписиПо(Команда)
ВыбДата = НачалоМесяца(ТекущаяДата())-1;
	Если ВвестиДату(ВыбДата,"Выберите дату, включая которую будут удалены записи",ЧастиДаты.Дата) Тогда
	УдалитьЗаписиПоНаСервере(ВыбДата);
	КонецЕсли;
КонецПроцедуры
